betfair/templates/global/BFGlobalService.addPaymentCard.req.xml

<?xmlversion='1.0'encoding='UTF-8'?>
<SOAP-ENV:Envelope
xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'
xmlns:SOAP-ENC='http://schemas.xmlsoap.org/soap/encoding/'
xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
xmlns:xsd='http://www.w3.org/2001/XMLSchema'
xmlns:ns2='http://www.betfair.com/publicapi/types/global/v3/'
xmlns:ns1='http://www.betfair.com/publicapi/v3/BFGlobalService/'>
<SOAP-ENV:Body>
<ns1:addPaymentCard>
<ns1:request>
<header>
<sessionToken></sessionToken>
</header>
<cardNumber></cardNumber>
<cardType>VISA</cardType>
<startDate></startDate>
<expiryDate></expiryDate>
<issueNumber></issueNumber>
<billingName></billingName>
<nickName></nickName>
<password></password>
<address1></address1>
<address2></address2>
<address3></address3>
<address4></address4>
<town></town>
<county></county>
<zipCode></zipCode>
<country></country>
<cardStatus>LOCKED</cardStatus>
<header>
<clientStamp>0</clientStamp>
<sessionToken></sessionToken>
</header>
</ns1:request>
</ns1:addPaymentCard>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
